const menuData = {
  "인성관 식당": {
    dailyKcal: {
        "2025-09-01": [1160, 1080],
        "2025-09-02": [1060, 860],
        "2025-09-03": [980, 1010],
        "2025-09-04": [920, 980],
        "2025-09-05": [1030, 0],
    },
    corners: {
      "A코너": {
        price: 6000,
        dailyMenus: {
          "2025-09-01": ["돈까스계란덮밥", "미역장국", "한입떡볶이", "양배추샐러드/김치"],
          "2025-09-02": ["백미밥", "콩나물국", "순살안동찜닭","감자고로케*케찹","부추겉절이","배추김치"],
          "2025-09-03": ["백미밥","사골계란국","김치돈육두루치기","온두부*양념장","건파래볶음","배추김치"],
          "2025-09-04": ["콩나물밥*양념장","스팸고추장찌개","메추리알소보로장조림","얼갈이나물무침","도시락김","배추김치"],
          "2025-09-05": ["추가밥/양송이스프","접시가득스파게티","치킨가라아게토핑","피클/배추김치"]
        }
      },
      "B코너": {
        price: 5000,
        dailyMenus: {
          "2025-09-01": ["후리가케밥/미역장국","야채쫄면(大)","생선까스*타르타르소스","요구르트/배추김치"],
          "2025-09-02": ["참치김치덮밥","콩나물국","야채계란찜","감자고로케*케찹/깍두기"],
          "2025-09-03": ["백미밥","사골왕만두국(大)","김말이강정","숙주나물/배추김치"],
          "2025-09-04": ["백미밥","스팸고추장찌개(大)","부추간장떡갈비","오이송송이/배추김치"],
          "2025-09-05": ["B코너 미운영"]
        }
      },
      "PLUS 코너": {
        price: 0,
        dailyMenus: {
          "2025-09-01": ['라면 (₩3000)', '밥/김치 (₩500)'],
          "2025-09-02": ['라면 (₩3000)', '밥/김치 (₩500)'],
          "2025-09-03": ['라면 (₩3000)', '밥/김치 (₩500)'],
          "2025-09-04": ['라면 (₩3000)', '밥/김치 (₩500)'],
          "2025-09-05": ['라면 (₩3000)', '밥/김치 (₩500)']
        }
      }
    }
  },

  "용오름대학 식당": {
    corners: {
      "A코너": {
        price: 5000,
        dailyMenus: {
          "2025-09-01": ["현재 운영되지 않는 식당입니다."],
          "2025-09-02": ["현재 운영되지 않는 식당입니다."],
          "2025-09-03": ["현재 운영되지 않는 식당입니다."],
          "2025-09-04": ["현재 운영되지 않는 식당입니다."],
          "2025-09-05": ["현재 운영되지 않는 식당입니다."]
        }
      },
      "B코너": {
        price: 5000,
        dailyMenus: {
          "2025-09-01": ["현재 운영되지 않는 식당입니다."],
          "2025-09-02": ["현재 운영되지 않는 식당입니다."],
          "2025-09-03": ["현재 운영되지 않는 식당입니다."],
          "2025-09-04": ["현재 운영되지 않는 식당입니다."],
          "2025-09-05": ["현재 운영되지 않는 식당입니다."]
        }
      }
    }
  },

  "기숙사 식당": {
    corners: {
      "조식": {
        price: 0,
        dailyMenus: {
          "2025-09-01": ["한입스테이크","쌀밥","계란만두국","숙주나물","양념고추지","배추김치"],
          "2025-09-02": ["미트볼채소조림","쌀밥","김치콩나물국","감자햄볶음","도시락김","배추김치"],
          "2025-09-03": ["돈버섯불고기","쌀밥","된장찌개","고구마맛탕","오복지무침","배추김치"],
          "2025-09-04": ["소고기국밥","쌀밥","비엔나소세지볶음","계란찜","상추겉절이","깍두기"],
          "2025-09-05": ["돼지고기김치찌개","쌀밥","떡갈비조림","어묵채볶음","미역줄기볶음","깍두기"]
        }
      },
      "중식": {
        price: 0,
        dailyMenus: {
          "2025-09-01": ["순대철판볶음","흑미밥","잔치국수","맛살냉채","콩나물무침","배추김치"],
          "2025-09-02": ["어니언치킨까스","쌀밥","소고기미역국","어묵김치볶음","상추겉절이","깍두기"],
          "2025-09-03": ["돈목살김치볶음","쌀밥","맑은콩나물국","온두부","깻잎어묵전","배추김치"],
          "2025-09-04": ["매콤제육볶음","귀리밥","시금치된장국","잡채계란전","깻잎장아찌","배추김치"],
          "2025-09-05": ["차돌떡볶이","쌀밥","김치어묵국","야채춘권/칠리소스","무말랭이지","배추김치"]
        }
      },
      "석식": {
        price: 0,
        dailyMenus: {
          "2025-09-01": ["춘천닭갈비","흑미밥","얼갈이해장국","도토리묵/간장","치커리오리엔탈무침","배추김치"],
          "2025-09-02": ["마제덮밥","쌀밥","우동국물","야채튀김","무말랭이지","배추김치"],
          "2025-09-03": ["계란돈육장조림","쌀밥","김치국","푸실리칠리샐러드","고추장장아찌","깍두기"],
          "2025-09-04": ["국물돈까스","쌀밥","냉모밀소바","무말랭이지","단무지","배추김치"],
          "2025-09-05": ["안동찜닭","쌀밥","시래기된장국","고추장멸치볶음","마카로니에그샐러드","배추김치"]
        }
      }
    }
  }
};

export default menuData;
