const menuData = {
  "인성관 식당": {
    dailyKcal: {
        "2025-09-08": [945, 984],
        "2025-09-09": [1005, 965],
        "2025-09-10": [975, 955],
        "2025-09-11": [940, 975],
        "2025-09-12": [1175, 0],
    },
    corners: {
      "A코너": {
        price: 6000,
        dailyMenus: {
          "2025-09-08": ["백미밥","사골북어해장국","돈사태떡찜","꼬들어묵무침","양념고추지","배추김치"],
          "2025-09-09": ["백미밥","해물순두부찌개","간장돈육불고기","고추장감자조림","맛살오이냉채","배추김치"],
          "2025-09-10": ["오므라이스*소스","미역국","케이준치킨범벅","수제양배추피클","갈릭버터모닝빵","배추김치"],
          "2025-09-11": ["백미밥","부산식돼지국밥(大)","소면사리*다대기","백김치도토리묵무침","부추겉절이","깍두기"],
          "2025-09-12": ["추가밥","물만둣국","옛날짜장면(大)","수제탕수육*소스","단무지","배추김치"]
        }
      },
      "B코너": {
        price: 5000,
        dailyMenus: {
          "2025-09-08": ["추가밥", "유부가락우동(大)","멘치까스*카레소스","단무지/배추김치"],
          "2025-09-09": ["간장계란밥*양념장","돈육김치찌개(大)","고추마요미트볼","맛살오이냉채/깍두기"],
          "2025-09-10": ["마파두부덮밥","미역국","갈비만두찜*초간장","콩나물무침/배추김치"],
          "2025-09-11": ["김치볶음밥","계란후라이/어묵탕","비엔나야채볶음","도시락김/백김치/우유"],
          "2025-09-12": ["B코너 미운영"]
        }
      },
      "PLUS 코너": {
        price: 0,
        dailyMenus: {
          "2025-09-08": ['라면 (₩3000)', '밥/김치 (₩500)'],
          "2025-09-09": ['라면 (₩3000)', '밥/김치 (₩500)'],
          "2025-09-10": ['라면 (₩3000)', '밥/김치 (₩500)'],
          "2025-09-11": ['라면 (₩3000)', '밥/김치 (₩500)'],
          "2025-09-12": ['라면 (₩3000)', '밥/김치 (₩500)']
        }
      }
    }
  },

  "용오름대학 식당": {
    corners: {
      "A코너": {
        price: 5000,
        dailyMenus: {
          "2025-09-08": ["현재 운영되지 않는 식당입니다."],
          "2025-09-09": ["현재 운영되지 않는 식당입니다."],
          "2025-09-10": ["현재 운영되지 않는 식당입니다."],
          "2025-09-11": ["현재 운영되지 않는 식당입니다."],
          "2025-09-12": ["현재 운영되지 않는 식당입니다."]
        }
      },
      "B코너": {
        price: 5000,
        dailyMenus: {
          "2025-09-08": ["현재 운영되지 않는 식당입니다."],
          "2025-09-09": ["현재 운영되지 않는 식당입니다."],
          "2025-09-10": ["현재 운영되지 않는 식당입니다."],
          "2025-09-11": ["현재 운영되지 않는 식당입니다."],
          "2025-09-12": ["현재 운영되지 않는 식당입니다."]
        }
      }
    }
  },

  "기숙사 식당": {
    corners: {
      "조식": {
        price: 0,
        dailyMenus: {
          "2025-09-08": ["제육김치볶음","쌀밥","어묵채볶음","브로콜리/초장","콩나물국","배추김치"],
          "2025-09-09": ["어묵바튀김","쌀밥","얼갈이된장국","구이김","무말랭이지","배추김치"],
          "2025-09-10": ["닭곰탕","쌀밥","만두튀김","고추장아찌","콩나물무침","깍두기"],
          "2025-09-11": ["한그릇유부우동","쌀밥","교자만두찜","단무지","배추김치"],
          "2025-09-12": ["돼지고기김치볶음","쌀밥","얼큰콩나물국","온두부","고구마맛탕","배추김치"]
        }
      },
      "중식": {
        price: 0,
        dailyMenus: {
          "2025-09-08": ["봉추찜닭","쌀밥","비엔나떡볶음","치커리냉채","얼갈이된장국","배추김치"],
          "2025-09-09": ["파채돈불고기","쌀밥","김치콩나물국","비빔만두","깻잎장아찌","배추김치"],
          "2025-09-10": ["한그릇짜장면","쌀밥","순두부짬뽕국","치킨너겟","단무지","배추김치"],
          "2025-09-11": ["안동찜닭","쌀밥","들깨미역국","비빔국수","병아리콩조림","배추김치"],
          "2025-09-12": ["후라이드치킨","쌀밥","두부김치국","고추장아찌","치킨무","배추김치"]
        }
      },
      "석식": {
        price: 0,
        dailyMenus: {
          "2025-09-08": ["참치찌개","쌀밥","탕수육","빨강떡볶이","깻잎장아찌","배추김치"],
          "2025-09-09": ["제육볶음","쌀밥","옥수수콘샐러드","상추쌈/쌈장","소고기미역국","배추김치"],
          "2025-09-10": ["돈육계란장조림","쌀밥","뼈다귀해장국","김말이튀김","간장고추지","깍두기"],
          "2025-09-11": ["보쌈","쌀밥","미소유부된장국","상추쌈/쌈장","무생채","배추김치"],
          "2025-09-12": ["순대찜","쌀밥","꼬치어묵국","고구마튀김","애호박볶음","배추김치"]
        }
      }
    }
  }
};

export default menuData;
