const menuData = {
  "인성관 식당": {
    corners: {
      "A코너": {
        price: 6000,
        dailyMenus: {
          "2025-08-11": ["김치볶음밥", "쫄면한그릇", "야채고로케/소스","배추김치"],
          "2025-08-12": ["불고기", "된장찌개", "잡채"],
          "2025-08-13": ["제육볶음", "된장국", "김치"],
          "2025-08-14": ["순두부찌개", "계란말이", "밥"],
          "2025-08-15": ["갈비탕", "나물", "김치"]
        }
      },
      "B코너": {
        price: 5000,
        dailyMenus: {
          "2025-08-11": ['백미밥', '치즈부대찌개','피카츄까스/소스','미역줄기볶음','배추김치'],
          "2025-08-12": ["피자", "감자튀김"],
          "2025-08-13": ["파스타", "샐러드"],
          "2025-08-14": ["햄버거", "콜라"],
          "2025-08-15": ["스테이크", "감자튀김"]
        }
      },
      "PLUS 코너": {
        price: 0,
        dailyMenus: {
          "2025-08-11": ['라면 (₩3000)', '밥/김치 (₩500)'],
          "2025-08-12": ['라면 (₩3000)', '밥/김치 (₩500)'],
          "2025-08-13": ['라면 (₩3000)', '밥/김치 (₩500)'],
          "2025-08-14": ['라면 (₩3000)', '밥/김치 (₩500)'],
          "2025-08-15": ['라면 (₩3000)', '밥/김치 (₩500)']
        }
      }
    }
  },

  "용오름대학 식당": {
    corners: {
      "A코너": {
        price: 5000,
        dailyMenus: {
          "2025-08-11": ['참치김치찌개/라면사리','백미밥','미니돈까스','볼어묵조림','배추김치'],
          "2025-08-12": ["김밥", "라면", "튀김"],
          "2025-08-13": ["떡볶이", "순대"],
          "2025-08-14": ["갈비찜", "밥"],
          "2025-08-15": ["김치찌개", "계란찜"]
        }
      },
      "B코너": {
        price: 3000,
        dailyMenus: {
          "2025-08-11": ['치킨치즈까스','팽이장국','슈스트링/케찹','쫄면야채무침','배추김치'],
          "2025-08-12": ["김밥", "오뎅"],
          "2025-08-13": ["라볶이", "순대"],
          "2025-08-14": ["튀김", "만두"],
          "2025-08-15": ["떡볶이", "순대"]
        }
      }
    }
  },

  "기숙사 식당": {
    corners: {
      "조식": {
        price: 0,
        dailyMenus: {
          "2025-08-11": ['안동찜닭','쌀밥','순두부김치국','느타리버섯볶음','건파래볶음','배추김치'],
          "2025-08-12": ["된장찌개", "계란말이"],
          "2025-08-13": ["김치찌개", "두부조림"],
          "2025-08-14": ["제육볶음", "시금치나물"],
          "2025-08-15": ["갈비탕", "김치"]
        }
      },
      "중식": {
        price: 0,
        dailyMenus: {
          "2025-08-11": ['짬뽕','쌀밥','탕수육','단무지','배추김치'],
          "2025-08-12": ["피자", "콜라"],
          "2025-08-13": ["스파게티", "샐러드"],
          "2025-08-14": ["치킨", "밥"],
          "2025-08-15": ["스테이크", "감자튀김"]
        }
      },
      "석식": {
        price: 0,
        dailyMenus: {
          "2025-08-11": ['제육덮밥', '어묵국', '깐풍만두', '락교', '배추김치'],
          "2025-08-12": ["피자", "콜라"],
          "2025-08-13": ["스파게티", "샐러드"],
          "2025-08-14": ["치킨", "밥"],
          "2025-08-15": ["스테이크", "감자튀김"]
        }
      }
    }
  }
};

export default menuData;
